blairq/ESP32CAM-ONVIF/src/web_config.cpp
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });

    webConfigServer.on("/api/bt/scan", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        // Trigger scan if not enabled?
        // Return latest cache
        webConfigServer.send(200, "application/json", btManager.getLastScanResult());
    });
    #endif // BLUETOOTH_ENABLED
    
    // === OTA Backend State & Preparation ===
    static volatile int ota_progress = -1;
    static String ota_status_msg = "";

    auto prepare_for_ota = []() {
        Serial.println("[OTA] Preparing for OTA: Stopping services to free memory...");
        sd_recorder_stop_manual();
        // Stop camera to free massive framebuffers back to PSRAM/Heap
        esp_camera_deinit();
        delay(500); 
    };

    // === GitHub Background OTA Task ===
    auto otaGithubTask = [](void *pvParameters) {
        String url = String((char *)pvParameters);
        free(pvParameters);
        
        ota_progress = 0;
        ota_status_msg = "Connecting to GitHub...";
        
        WiFiClientSecure client;
        client.setInsecure();
        HTTPClient https;
        https.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
        https.setTimeout(30000); 
        
        if (https.begin(client, url)) {
            int httpCode = https.GET();
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                int contentLength = https.getSize();
                if (contentLength <= 0) {
                    ota_status_msg = "Invalid content length";
                    ota_progress = -2;
                    https.end();
                    vTaskDelete(NULL);
                    return;
                }
                
                if (Update.begin(contentLength, U_FLASH)) {
                    ota_status_msg = "Downloading firmware...";
                    WiFiClient *stream = https.getStreamPtr();
                    
                    uint8_t buff[1024];
                    size_t written = 0;
                    unsigned long lastDataTime = millis();
                    
                    while (https.connected() && written < contentLength) {
                        size_t available = stream->available();
                        if (available) {
                            int c = stream->readBytes(buff, ((available > sizeof(buff)) ? sizeof(buff) : available));
                            Update.write(buff, c);
                            written += c;
                            
                            ota_progress = (written * 100) / contentLength;
                            lastDataTime = millis();
                            
                            esp_task_wdt_reset();
                            yield();
                        } else {
                            if (millis() - lastDataTime > 15000) {
                                ota_status_msg = "Download timeout";
                                ota_progress = -2;
                                break;
                            }
                            delay(10);
                        }
                    }
                    
                    if (written == contentLength) {
                        if (Update.end(true)) {
                            ota_progress = 100;
                            ota_status_msg = "Update Complete. Rebooting...";
                            delay(1000);
                            ESP.restart();
                        } else {
                            ota_status_msg = "Update failed on end()";
                            ota_progress = -2;
                        }
                    } else {
                        ota_status_msg = "Download incomplete";
                        ota_progress = -2;
                        Update.abort();
                    }
                } else {
                    ota_status_msg = "Not enough space for OTA";
                    ota_progress = -2;
                }
            } else {
                ota_status_msg = "Failed to download (HTTP " + String(httpCode) + ")";
                ota_progress = -2;
            }
            https.end();
        } else {
            ota_status_msg = "Unable to connect to GitHub";
            ota_progress = -2;
        }
        
        vTaskDelete(NULL);
    };


    // === OTA Firmware Update (with authentication) ===
    webConfigServer.on("/api/update", HTTP_POST, [&prepare_for_ota]() {
        if (!isAuthenticated(webConfigServer)) return;
        HTTPUpload& upload = webConfigServer.upload();
        if (upload.status == UPLOAD_FILE_START) {
            Serial.printf("[OTA] Update: %s\n", upload.filename.c_str());
            prepare_for_ota();
            if (!Update.begin(UPDATE_SIZE_UNKNOWN, U_FLASH)) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_WRITE) {
            if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_END) {
            if (Update.end(true)) {
                Serial.printf("[OTA] Success: %u bytes\n", upload.totalSize);
            } else {
                Update.printError(Serial);
            }
        }
    }, [&prepare_for_ota]() {
        // Auth check on upload start
        if (!webConfigServer.authenticate(WEB_USER, WEB_PASS)) {
            return;
        }
        HTTPUpload& upload = webConfigServer.upload();
        if (upload.status == UPLOAD_FILE_START) {
            Serial.printf("[OTA] Update: %s\n", upload.filename.c_str());
            prepare_for_ota();
            if (!Update.begin(UPDATE_SIZE_UNKNOWN, U_FLASH)) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_WRITE) {
            if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_END) {
            if (Update.end(true)) {
                Serial.printf("[OTA] Success: %u bytes\n", upload.totalSize);
            } else {
                Update.printError(Serial);
            }
        }
    });

    // === GitHub OTA Check ===
    webConfigServer.on("/api/update/check", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        WiFiClientSecure client;
        client.setInsecure(); // GitHub API requires HTTPS. Using insecure for simplicity/memory.
        HTTPClient https;
        
        String url = String("https://api.github.com/repos/") + GITHUB_REPO_OWNER + "/" + GITHUB_REPO_NAME + "/releases/latest";
        
        if (https.begin(client, url)) {
            int httpCode = https.GET();
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                String payload = https.getString();
                
                // Parse JSON to get tag_name and browser_download_url
                DynamicJsonDocument doc(4096);
                DeserializationError error = deserializeJson(doc, payload);
                
                if (!error) {
                    String tagName = doc["tag_name"] | "";
                    String downloadUrl = "";
                    
