blairq/ESP32CAM-ONVIF/src/web_config.cpp
                    JsonArray assets = doc["assets"];
                    for (JsonObject asset : assets) {
                        String name = asset["name"] | "";
                        if (name.endsWith(".bin")) {
                            downloadUrl = asset["browser_download_url"] | "";
                            break;
                        }
                    }
                    
                    String response = "{";
                    response += "\"current_version\":\"" + String(FIRMWARE_VERSION) + "\",";
                    response += "\"latest_version\":\"" + tagName + "\",";
                    response += "\"download_url\":\"" + downloadUrl + "\"";
                    response += "}";
                    
                    webConfigServer.send(200, "application/json", response);
                } else {
                    webConfigServer.send(500, "application/json", "{\"error\":\"Failed to parse GitHub response\"}");
                }
            } else {
                webConfigServer.send(500, "application/json", "{\"error\":\"Failed to fetch from GitHub: " + String(httpCode) + "\"}");
            }
            https.end();
        } else {
            webConfigServer.send(500, "application/json", "{\"error\":\"Unable to connect to GitHub API\"}");
        }
    });

    // === GitHub OTA Download & Install (Async) ===
    webConfigServer.on("/api/update/github", HTTP_POST, [prepare_for_ota, otaGithubTask]() {
        if (!isAuthenticated(webConfigServer)) return;
        
        if (ota_progress >= 0 && ota_progress < 100) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Update already in progress\"}");
            return;
        }

        StaticJsonDocument<512> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        
        if (err || !doc.containsKey("url")) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Missing download URL\"}");
            return;
        }
        
        String url = doc["url"].as<String>();
        
        prepare_for_ota();
        
        // Allocate URL string on heap for the task
        char *urlStr = (char *)malloc(url.length() + 1);
        strcpy(urlStr, url.c_str());
        
        xTaskCreate(otaGithubTask, "otaTask", 8192, (void *)urlStr, 1, NULL);
        
        webConfigServer.send(200, "application/json", "{\"success\":true, \"message\":\"Downloading firmware in background\"}");
    });

    // === OTA Status Polling ===
    webConfigServer.on("/api/update/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String response = "{";
        response += "\"progress\":" + String(ota_progress) + ",";
        response += "\"message\":\"" + ota_status_msg + "\"";
        response += "}";
        
        webConfigServer.send(200, "application/json", response);
    });


    // === Integration Settings (MQTT + Telegram) ===
    webConfigServer.on("/api/settings", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<1024> doc;
        doc["btEnabled"] = appSettings.btEnabled;
        doc["btStealth"] = appSettings.btStealthMode;
        doc["btMac"]     = appSettings.btPresenceMac;
        doc["btTimeout"] = appSettings.btPresenceTimeout;
        doc["btGain"]    = appSettings.btMicGain;
        doc["hwGain"]    = appSettings.hwMicGain;
        doc["audioSrc"]  = (int)appSettings.audioSource;
        
        doc["mqttEnabled"] = appSettings.mqttEnabled;
        doc["mqttBroker"] = appSettings.mqttBroker;
        doc["mqttPort"] = appSettings.mqttPort;
        doc["mqttUser"] = appSettings.mqttUser;
        doc["mqttPass"] = appSettings.mqttPassword;
        
        doc["tgEnabled"] = appSettings.telegramEnabled;
        doc["tgToken"] = appSettings.telegramBotToken;
        doc["tgChatId"] = appSettings.telegramChatId;
        
        doc["gdEnabled"] = appSettings.googleDriveEnabled;
        doc["gdMotion"] = appSettings.googleDriveMotion;
        doc["gdUrl"] = appSettings.googleDriveScriptUrl;
        
        doc["webDav"] = appSettings.webDavEnabled;
        doc["contRec"] = appSettings.continuousRecordingEnabled;
        doc["contRecChunk"] = appSettings.continuousRecordingChunkSize;
        doc["ntp"] = appSettings.ntpServer;
        doc["tz"] = appSettings.timeZone;

        String response;
        serializeJson(doc, response);
        webConfigServer.send(200, "application/json", response);
    });

    webConfigServer.on("/api/settings", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<1024> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        if (err) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }

        if(doc.containsKey("btEnabled")) appSettings.btEnabled = doc["btEnabled"];
        if(doc.containsKey("btStealth")) appSettings.btStealthMode = doc["btStealth"];
        if(doc.containsKey("btMac"))     strncpy(appSettings.btPresenceMac, doc["btMac"], sizeof(appSettings.btPresenceMac) - 1);
        if(doc.containsKey("btTimeout")) appSettings.btPresenceTimeout = doc["btTimeout"];
        if(doc.containsKey("btGain"))    appSettings.btMicGain = doc["btGain"];
        if(doc.containsKey("hwGain"))    appSettings.hwMicGain = doc["hwGain"];
        if(doc.containsKey("audioSrc"))  appSettings.audioSource = (AudioSource)doc["audioSrc"].as<int>();

        if(doc.containsKey("mqttEnabled")) appSettings.mqttEnabled = doc["mqttEnabled"];
        if(doc.containsKey("mqttBroker")) strncpy(appSettings.mqttBroker, doc["mqttBroker"], sizeof(appSettings.mqttBroker) - 1);
        if(doc.containsKey("mqttPort")) appSettings.mqttPort = doc["mqttPort"];
        if(doc.containsKey("mqttUser")) strncpy(appSettings.mqttUser, doc["mqttUser"], sizeof(appSettings.mqttUser) - 1);
        if(doc.containsKey("mqttPass")) strncpy(appSettings.mqttPassword, doc["mqttPass"], sizeof(appSettings.mqttPassword) - 1);

