blairq/ESP32CAM-ONVIF/src/web_config.cpp
        if(doc.containsKey("tgEnabled")) appSettings.telegramEnabled = doc["tgEnabled"];
        if(doc.containsKey("tgToken")) strncpy(appSettings.telegramBotToken, doc["tgToken"], sizeof(appSettings.telegramBotToken) - 1);
        if(doc.containsKey("tgChatId")) strncpy(appSettings.telegramChatId, doc["tgChatId"], sizeof(appSettings.telegramChatId) - 1);

        if(doc.containsKey("gdEnabled")) appSettings.googleDriveEnabled = doc["gdEnabled"];
        if(doc.containsKey("gdMotion")) appSettings.googleDriveMotion = doc["gdMotion"];
        if(doc.containsKey("gdUrl")) strncpy(appSettings.googleDriveScriptUrl, doc["gdUrl"], sizeof(appSettings.googleDriveScriptUrl) - 1);

        if(doc.containsKey("webDav")) appSettings.webDavEnabled = doc["webDav"];
        if(doc.containsKey("contRec")) appSettings.continuousRecordingEnabled = doc["contRec"];
        if(doc.containsKey("contRecChunk")) appSettings.continuousRecordingChunkSize = doc["contRecChunk"];
        if(doc.containsKey("ntp")) strncpy(appSettings.ntpServer, doc["ntp"], sizeof(appSettings.ntpServer) - 1);
        if(doc.containsKey("tz")) strncpy(appSettings.timeZone, doc["tz"], sizeof(appSettings.timeZone) - 1);

        saveSettings();
        webConfigServer.send(200, "application/json", "{\"success\":true,\"message\":\"Settings Saved\"}");
    });

    // --- WebDAV Integration ---
    const char * headerkeys[] = {"Depth"};
    size_t headerkeyssize = sizeof(headerkeys) / sizeof(char*);
    webConfigServer.collectHeaders(headerkeys, headerkeyssize);
    webdav_server_init(&webConfigServer);

    webConfigServer.begin();
        Serial.println("[INFO] Web config server started.");
}

void web_config_loop() {
        webConfigServer.handleClient();
        
        // Track heap low-water mark for fragmentation monitoring
        uint32_t freeHeap = ESP.getFreeHeap();
        if (freeHeap < s_minFreeHeap) {
            s_minFreeHeap = freeHeap;
        }
    }